/* Arrays!  
   Anything can be an array.  Arrays are really associative arrays.
   Wow, that's neat.
   And apparently a.whatever has nothing to do with a
   Heh.
*/
a = 10
/* Ooh... this assigns ALL values of a.whatever to 91, even undefined ones! */
a. = 91
a.1 = 20
a.2 = 30
a.foo = 40

say a a.1 a.2 a.foo a.bar a.
a. = "Blop!"
say a. a.1 a.2 a.3
