/* Comments, yay! */

/* "pull" is "input" */
say 'Type a number!'
pull a
/* 50 significant digits */
numeric digits 50
b = a * a
c = 1 / a
d = 3 + a
e = 2 ** (a - 1)
say "Results are: " b c d e
