/* Concatenating strings just by putting 'em next to each other? 
   Awsome!
*/
a = 'Hello'
b = 'World!'
c = a b
d = a':' b
e = a || ' @ ' || b
/* Case insensitive */
say C
say D
say E

/* If a variable has no value, it's treated as an uppercase string */
say hello there!

say date( "W" )"," date()
